OpenFOAM-v2112/tutorials/compressible/rhoSimpleFoam/aerofoilNACA0012/system/extrudeMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2112                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

constructFrom patch;
sourceCase    "<case>";

sourcePatches (back);
exposedPatchName front;

extrudeModel  linearDirection;
direction     (0 -1 0);
thickness     0.1;

flipNormals false;
mergeFaces false;


// ************************************************************************* //
